# Отчет по лабораторной работе N 15 по курсу
# "Фундаментальная информатика"

Студент группы: M80-107Б, Павлов Иван Дмитриевич\
Контакты: pavlov.id.2003@mail.ru\
Работа выполнена: 25.09.2021\
Преподаватель: Найденов Иван Евгеньевич\

## 1. Тема

Матрицы Си

## 2. Цель работы

В соответствии с вариантом задания составить программу вывода массива.

## 3. Задание

№23

## 4. Оборудование

Процессор: AMD Ryzen 5 4600H with Radeon Graphics\
ОП: 7851 Мб\
НМД: 256 Гб\
Монитор: 1920x1080\

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **20.04.3 LTS**\
Интерпретатор команд: **bash**, версия **5.0.17(1)-release**.\
Система программирования: *gcc**, версия **17**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**\

## 6. Идея, метод, алгоритм решения задачи

1) Ввести данные аналогично с ЛР №14.
2) Найти максимальный элемент матрицы, запомнить номер строки и просуммировать все элементы этой строки.

## 7. Сценарий выполнения работы

### Тесты:

| Ввод | Вывод | 
| ---- | ----- | 
| 2 4 <br> 4 <br> 4   5 11 15 <br> 10  3  6 12 <br> 14  9  2  7 <br> 16 13  8  1 <br> 1 <br> 1000  | 38 <br> 1000 |

## 8. Распечатка протокола

```
#include <stdio.h>

int main(void)
{
    long long cnt, max;
    scanf("%lld%lld", &cnt, &max);
    long long a[max][max];
    for (long long t = 0; t < cnt; ++t) {
        long long n;
        scanf("%lld", &n);
        for (long long i = 0; i < n; ++i) {
            for (long long j = 0; j < n; ++j) {
                scanf("%lld", &a[i][j]);
            }
        }
        int nstr = 0, maxel = -500000;
        for (long long i = 0; i < n; ++i) {
            for (long long j = 0; j < n; ++j) {
                if (a[i][j] > maxel) {
                    maxel = a[i][j];
                    nstr = i;
                }
            }
        }
        if (n == 1) {
            printf("%lld\n", a[0][0]);
            continue;
        }
        long long s = 0;
        long long j = 0;
        while (j <= n - 1) {
            s += a[nstr][j];
            j++;
        }
        printf("%lld\n", s);
    }
    return 0;
}

```

## 9. Дневник отладки

| № | Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| - | ------------- | ---- | ----- | ------- | ----------------------- | ---------- |
| 1 | Лаб | 27.11.2021 | 09:12 | ошибка на тесте 2 | объявлял счетчики вне цикла | исправил |

## 10. Замечания автора по существу работы

## 11. Выводы

В ходе данной лабораторной работы была спроектирована программа выполняющая заданную задачу и получены навыки работы и преобразования матриц на языке Си.